In [1]:
import pandas as pd

In [3]:
'''Series possui um índice, chamado index que rotula cada elemento, e permite que ele seja acessado através desse índice.'''
s = pd.Series([1,2,3,4,5])

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
'''Para exibir apenas os valores, basta chamar o atributo values do objeto'''
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
#caso você precise acessar o quarto elemento da Series, escreva:
s[3]

4

In [8]:
'''Series de dados fictícios de quantidade de acidentes automobilísticos ao longo de um ano'''
s = pd.Series([15,20,12,16,10,11,12,15,9,10,12,17], index = ['jan','fev', 'mar', 'abr', 'mai', 'jun', 'jul', 'ago', 'set','out','nov', 'dez'])

In [9]:
s

jan    15
fev    20
mar    12
abr    16
mai    10
jun    11
jul    12
ago    15
set     9
out    10
nov    12
dez    17
dtype: int64

In [10]:
'''podemos calcular a média e o desvio padrão de uma Series através dos métodos mean() e std(), e também calcular os valores máximo e mínimo de uma Series, através dos métodos max() e min()'''
s.mean()

13.25

In [11]:
s.std()

3.333712099692528

In [12]:
s.max()

20

In [13]:
s.min()

9

In [14]:
'''O pandas dispõe de um método bastante útil que calcula e exibe diversas medidas estatísticas de uma Series ao mesmo tempo, chamado describe().'''
s.describe()

count    12.000000
mean     13.250000
std       3.333712
min       9.000000
25%      10.750000
50%      12.000000
75%      15.250000
max      20.000000
dtype: float64

In [18]:
#Para fazer o somatório dos acidentes ocorridos durante o ano, utiliza-se o método sum()
s.sum()

159

In [16]:
'''Caso você queira saber a média dos acidentes no segundo semestre, você pode selecionar os últimos 6 meses e aplicar o método mean().'''
s[6:].mean()

12.5

In [19]:
'''Existem diversas formas de criar DataFrames. A mais simples é passando um dicionário de Python, utilizando o mapeamento chave-valor. A chave é o nome da variável, e o valor passado é uma coleção de valores'''
df = pd.DataFrame({'Aluno' : ['Marina','Felipe','Cleyton','Isabel'],
'Créditos cursados': [20,64,32,24],
'Rendimento acadêmico' : [8.55,7.88,8.17,9.04],
'Mês de nascimento' : ['Novembro','Setembro','Janeiro','Julho'],
'Curso': ['Computação','Estatística','Computação','Matemática']})

In [20]:
df

,Aluno,Créditos cursados,Rendimento acadêmico,Mês de nascimento,Curso
0,Marina,20,8.55,Novembro,Computação
1,Felipe,64,7.88,Setembro,Estatística
2,Cleyton,32,8.17,Janeiro,Computação
3,Isabel,24,9.04,Julho,Matemática

In [21]:
'''Podemos utilizar o index para acessar linhas específicas, entretanto devemos chamar o método iloc().'''
df.iloc[2]

Aluno                      Cleyton
Créditos cursados               32
Rendimento acadêmico          8.17
Mês de nascimento          Janeiro
Curso                   Computação
Name: 2, dtype: object

In [22]:
'''Você pode selecionar as colunas individualmente e aplicar sobre elas os mesmos métodos utilizados em Series! Para isso, seleciona-se uma coluna através do nome dela entre colchetes, de forma idêntica ao conceito chave-valor dos dicionários de Python.'''
df['Rendimento acadêmico']

0    8.55
1    7.88
2    8.17
3    9.04
Name: Rendimento acadêmico, dtype: float64

In [23]:
#Média de rendimento da turma
df['Rendimento acadêmico'].mean()

8.41

In [24]:
'''Você pode ainda utilizar o método describe() da mesma maneira que na Series, para calcular diferentes medidas estatísticas em todas as variáveis quantitativas de uma só vez.'''
df.describe()

       Créditos cursados  Rendimento acadêmico
count           4.000000              4.000000
mean           35.000000              8.410000
std            19.966639              0.501664
min            20.000000              7.880000
25%            23.000000              8.097500
50%            28.000000              8.360000
75%            40.000000              8.672500
max            64.000000              9.040000

In [25]:
'''Para ler um arquivo CSV, utilize o método read_csv, passando como argumento o caminho do arquivo na máquina. Caso os dados estejam disponíveis na Web, você pode passar como argumento a URL dos dados. 
Os dados , em inglês, são referentes ao consumo de álcool por pessoa em diferentes países, coletados pela Organização Mundial da Saúde no ano de 2010.'''

df=pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/alcohol-consumption/drinks.csv')

In [26]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [27]:
'''Caso o DataFrame tenha muitas linhas, como no exemplo a seguir, a tabela não será exibida inteiramente. Um método muito utilizado é o head(), que recebe como parâmetro um número inteiro e exibe apenas essa quantidade do topo das linhas do DataFrame. Por exemplo, se você quiser exibir as 6 primeiras linhas do DataFrame.'''
df.head(6)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
5,Antigua & Barbuda,102,128,45,4.9

In [28]:
'''Para responder perguntas em grandes datasets, pode ser importante selecionar dados que atendam a condições específicas. Para isso, é utilizada a chamada indexação booleana. Você utiliza como chave a condição desejada entre os colchetes. Para ilustrar essa sintaxe, imagine que você queira saber os dados a respeito de consumo de álcool no Brasil.'''
df[df['country'] == 'Brazil']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
23,Brazil,245,145,16,7.2

In [29]:
#Se você quiser saber os países cujo consumo total de álcool é maior ou igual a 12 litros por pessoa, faça assim
df[df['total_litres_of_pure_alcohol'] >= 12]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
3,Andorra,245,138,312,12.4
15,Belarus,142,373,42,14.4
98,Lithuania,343,244,56,12.9

In [30]:
#Se você quiser exibir apenas os 5 primeiros resultados da seleção dos países nos quais o consumo de álcool é igual a 0, você pode chamar o método head() após a seleção.
df[df['total_litres_of_pure_alcohol'] == 0].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
13,Bangladesh,0,0,0,0.0
46,North Korea,0,0,0,0.0
79,Iran,0,0,0,0.0
90,Kuwait,0,0,0,0.0

In [31]:
#Outra operação muito útil é ordenar os dados a partir de uma variável do maior para o menor, ou do menor para o maior. No pandas, isso é feito pelo método sort_values().
df.sort_values(by='wine_servings', ascending = False).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
61,France,127,151,370,11.8
136,Portugal,194,67,339,11.0
3,Andorra,245,138,312,12.4
166,Switzerland,185,100,280,10.2
48,Denmark,224,81,278,10.4